Revit 2026 API

# ConnectorWidth Property

---

The width of the connector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual double Width { get; set; }
```
```vb
Public Overridable Property Width As Double
	Get
	Set
```
```cpp
public:
virtual property double Width {
	double get ();
	void set (double value);
}
```
```fsharp
abstract Width : float with get, set
override Width : float with get, set
```

#### Property Value

Double

#### Implements

IConnectorWidth

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the connector's shape is not rectangular. |
| ArgumentException | Thrown when the argument is invalid. |
| InvalidOperationException | Thrown on failure to set width. |

In order to set this property, it must be mapped to a writable instance parameter in the family definition.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace